# LayoutRule Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BeamSystem..::..LayoutRule Property
BeamSystem Class See Also
---
Retrieves or changes the LayoutRule of the BeamSystem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LayoutRule LayoutRule { get; set; }
```

Visual Basic
---
```text
Public Property LayoutRule As LayoutRule
	Get
	Set
```

Visual C++
---
```text
public:
property LayoutRule^ LayoutRule {
	LayoutRule^ get ();
	void set (LayoutRule^ value);
}
```

# See Also
BeamSystem Class
Autodesk.Revit.DB Namespace